<?php

namespace Database\Seeders;

use App\Models\Section;
use Illuminate\Database\Seeder;

class SectionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $types = [
            'Տնօրենության տեխնիկա'
            , 'Փոխտնօրենի աշխատասենյակ'
            , 'Խորհրդակցությունների դահլիճ'
            , 'ՏՀՍԶԲ'
            , 'Պահակակետ'
            , 'Տպարան'
            , 'ՈւսՄՎ'
            , 'ՄԿՈԱԲ'
            , 'Գիտքարտուղար'
            , 'ԱԿԻԱԲ'
            , 'ՏԳԿՍԲ, ԳՄՊԲ'
            , 'Հաշվապահություն'
            , 'Գրադարան'
            , 'Հյուրանոցային համալիր'
            , 'Դահլիճ, ՈՒԽ և ՈՒԳԸ'
            , 'Տնտեսագիտության ֆակուլտետ'
            , 'Լսարան 38'
            , 'Լսարան 39'
            , 'Լսարան 41'
            , 'Լսարան 48'
            , 'Լսարան 11'
            , 'Լսարան 28'
            , 'Լսարան 31'
            , 'Լսարան 50'
            , 'Լսարան 51'
            , 'Լսարան 53'
            , 'Լսարան 54'
            , 'Լսարան 56'
            , 'Լսարան 57'
            , 'Հումանիտար գիտությունների ֆակուլտետ - դեկանատ'
            , 'Փոխդեկանի աշխատասենյակ'
            , 'Մանկավարժության և հոգեբանության ամբիոն'
            , 'Օտար լեզուների ամբիոն'
            , 'Հայոց պատմության և հասարակագիտության ամբիոն'
            , 'Հայոց լեզվի և գրականության ամբիոն'
            , 'Սրահ /Հում+Տնտ/'
            , 'Կիր արվեստի ֆակուլտետ'
            , 'Սրահ Կիրառական արվեստի ֆակուլտետի'
            , 'Բնագիտական ֆակուլտետի դեկանատ'
            , 'Բնագիտական ֆակուլտետի ամբիոն'
            , 'Մեխատրոնիկայի լաբորատորիա'
            , 'Սրահ 1'
            , 'Սրահ 2'
            , 'Լսարան 05'
            , 'Լսարան 06'
            , 'Տեսահսկման խցիկներ'
        ];

        foreach ($types as $section) {
            Section::query()->create(['name' => $section]);
        }
    }
}
